flight/src/xml/CheckAvailableRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:flig="http://jawxs.flightservice.kth.se/jaxws/flightbookingprocess">
   <soapenv:Header/>
   <soapenv:Body>
      <flig:checkAvailable>
         <!--Zero or more repetitions:-->
         <arg0>
            <!--Optional:-->
            <departureCity>Stockholm</departureCity>
            <!--Optional:-->
            <destinationCity>Berlim</destinationCity>

         </arg0>
         <arg0>

            <!--Optional:-->
            <departureCity>Berlim</departureCity>
            <!--Optional:-->
            <destinationCity>Madrid</destinationCity>
         </arg0>

         <!--Optional:-->
         <arg1>2013-02-06</arg1>
         <!--Optional:-->
         <arg2>jfdoKJgUOUG8SD89568gGDhjkgid</arg2>
      </flig:checkAvailable>
   </soapenv:Body>
</soapenv:Envelope>